var _data;
// if(!_data){
// 		//send request to get data
// 		$.ajax({
// 			url : ,
// 			dataType : 'jsonp',
// 			jsonpCallback: '__data_callback',
// 			success : function(data,status) {
// 				_data = turnArray(data.data);
// 				update();
// 			}
// 		});
// }

// Fake data
_data = [
{
"name":"可可草莓布丁  ",
"poi_name":"黎昌海鲜大酒楼(方庄店)",
"content":"上大学时候经常听到广播里关于黎昌海鲜的广告，终于有机会尝一尝，直接打车跨了大半个北京城，交通算是比较方便。说起来也算是一家老店了，和接待的美女聊起十几年前交通台的广告她居然熟悉的狠，距离又拉近了一点。另外餐厅环境真心不错，服务也很好非常适合请客聊天。说吃的吧。菜做的非常精致，虾球口感外酥内嫩，剁椒蒸鱼腹肉肉嫩的一塌糊涂，尤其是剁椒一尝就是店里自己做的味，问了问果然，咸香口感都恰到好处。蛤蜊汤保持了原汁原味的鲜美值得尝尝，另外田园大拌菜也做出了鲜有的脆爽，从不算家常的消费到开了这么久看得出来，菜品的实力还是很强的。但有时候吃饭更在意的是心情，单单只是服务生不矫情的笑容就让你如沐春风觉自然心情胃口都特别好。赞！"
},
{
"name":"第二青睐丶",
"poi_name":"muse酒吧",
"content":"去一次就爱上了。在青岛呆了十天几乎每晚都去都跟吧里的工作人员熟了，每天玩到他们下班一起宵夜，muse虽然小点但是气氛真的很棒。外国人很多大多是学生大部分是德国人。还有从头跳到尾疯子一样的韩国人，土豪什么的更不用谈了美女如云。还算挺正规人多但不会乱保安很给力一看到争吵打架的直接从栏杆后面飞过去制止。也很安全一般丢东西的情况不会发生除非自己喝多了不知道丢哪了。正值世界杯更热闹了工作日一般到凌晨三点的样子人就散了周末更嗨。节目一星期一换还不错，歌手还会下来跟你喝两杯。临走前还送了我一套muse2014的嗨曲碟片。实在太酷了，值得一去，回来后每天都会回味在muse的日子。还会再去！！！"
},
{
"name":"第二青睐丶",
"poi_name":"muse酒吧",
"content":"去一次就爱上了。在青岛呆了十天几乎每晚都去都跟吧里的工作人员熟了，每天玩到他们下班一起宵夜，muse虽然小点但是气氛真的很棒。外国人很多大多是学生大部分是德国人。还有从头跳到尾疯子一样的韩国人，土豪什么的更不用谈了美女如云。还算挺正规人多但不会乱保安很给力一看到争吵打架的直接从栏杆后面飞过去制止。也很安全一般丢东西的情况不会发生除非自己喝多了不知道丢哪了。正值世界杯更热闹了工作日一般到凌晨三点的样子人就散了周末更嗨。节目一星期一换还不错，歌手还会下来跟你喝两杯。临走前还送了我一套muse2014的嗨曲碟片。实在太酷了，值得一去，回来后每天都会回味在muse的日子。还会再去！！！"
},
{
"name":"可可草莓布丁",
"poi_name":"黎昌海鲜大酒店（方庄店）",
"content":"上大学时候经常听到广播里关于黎昌海鲜的广告，终于有机会尝一尝，直接打车跨了大半个北京城，交通算是比较方便。说起来也算是一家老店了，和接待的美女聊起十几年前交通台的广告她居然熟悉的狠，距离又拉近了一点。另外餐厅环境真心不错，服务也很好非常适合请客聊天。说吃的吧。菜做的非常精致，虾球口感外酥内嫩，剁椒蒸鱼腹肉肉嫩的一塌糊涂，尤其是剁椒一尝就是店里自己做的味，问了问果然，咸香口感都恰到好处。蛤蜊汤保持了原汁原味的鲜美值得尝尝，另外田园大拌菜也做出了鲜有的脆爽，从不算家常的消费到开了这么久看得出来，菜品的实力还是很强的。但有时候吃饭更在意的是心情，单单只是服务生不矫情的笑容就让你如沐春风觉自然心情胃口都特别好。赞！"
},
{
"name":"abc",
"poi_name":"abc",
"content":"abc"
},
{
"name":"abc",
"poi_name":"abc",
"content":"abc"
},
{
"name":"abc",
"poi_name":"abc",
"content":"abc"
},
{
"name":"abc",
"poi_name":"abc",
"content":"abc"
},
{
"name":"abc",
"poi_name":"abc",
"content":"abc"
},
{
"name":"你好",
"poi_name":"百度大厦",
"content":"很大"
}
];
success(_data);
function success(data) {
	_data = data;
	update();
}


	$(window).on("hashchange",update);

	function update() {

		var view = end_pager({
			data : _data,
			per_page : 3,
			page : getPage()
		})
		$(".pager-list").html(view['pager']);
		$("#comment_list").html(view['content']);
	}

	// 获取页码
	function getPage() {
		var hash = window.location.hash;

		if(hash.indexOf("#!page=") > -1) {
			return hash.replace("#!page=",'')
		} else {
			return false;
		}
	}